Repository: piggly-dev/piggly-views-wordpress
Catalog: languages/piggly_views-*.po
Languages: pt_br

source: Welcome to Piggly Views
pt_br: Bem-vindo ao Piggly Views

source: What is new in Piggly Views
pt_br: O que há de novo no Piggly Views

source: Views
pt_br: Visualizações

source: Not tracking
pt_br: Não está rastreando

source: About
pt_br: Sobre

source: Hello there! The Piggly View plugin is quite simple to use.
pt_br: Olá por aí! O plugin Piggly View é bastante simples de usar.

source: It will store all views for a Single Post. Below you can configure it to ignore views to logged users and disable for some posts.
pt_br: Ele armazenará todas as visualizações para uma única postagem. Abaixo, você pode configurá-lo para ignorar as visualizações de usuários conectados e desabilitar para algumas postagens.

source: In the Posts View Table you will see the View column. Below you can remove it.
pt_br: Na tabela de exibição de postagens, você verá a coluna Visualizações. Abaixo você pode removê-la.

source: All views will be cached for 24 hours. Below you can disabled it or change the flush cache hour.
pt_br: Todas as visualizações serão armazenadas em cache por 24 horas. Abaixo, você pode desabilitá-lo ou alterar a hora de atualização do cache.

source: You can use the shortcode <code>[piggly_view]</code> to get views to the current post OR use <code>[piggly_view id="post_id"]</code> to a specific post. It will return the number of views following the format set in the settings.
pt_br: Você pode usar o shortcode <code>[piggly_view]</code> para obter visualizações para a postagem atual OU usar <code>[piggly_view id="post_id"]</code> para uma postagem específica. Retornará o número de visualizações seguindo o formato definido nas configurações.

source: You can get a collection of most viewed posts by using the method <code>piggly_view_collection($limit,$days,$types)</code>. Where <code>$days</code> is the range between NOW and X(<code>$days</code>) days, <code>$limit</code> is the number of posts and <code>$types</code> is one or more post types slug into an array, such as: <code>post</code>, <code>page</code> or <code>attachment</code>.
pt_br: Você pode obter uma coleção das postagens mais visualizadas usando o método <code>piggly_view_collection($limit,$days)</code> . Onde <code>$days</code> é o intervalo entre os dias AGORA e X (<code>$days</code>) dias, <code>$limit</code> é o número de postagens e <code>$types</code> é um ou mais tipos de postagens dentro de um array, como: <code>post</code>, <code>page</code> ou <code>attachment</code>.

source: Most Viewed
pt_br: Mais Visualizados

source: An easy way to get the most viewed posts is using the global function <code>piggly_view_collection()</code>. The default days values is 30 and default limit value is 5.
pt_br: Um jeito fácil de obter as postagens mais visualizadas é utilizando a função global <code>piggly_view_collection()</code>. O valor padrão para os dias é 30 e para a quantidade de publicação é 5.

source: 10 most viewed posts in the last 180 days.
pt_br: 10 postagens mais visualizadas dos últimos 180 dias.

source: Settings
pt_br: Configurações

source: Display View Column
pt_br: Exibir a Coluna de Visualizações

source: Disable tracking for Logged Users
pt_br: Desabilitar rastreamento para Usuários Conectados

source: Convert Views from 1000 to 1K format
pt_br: Converter Visualizações de 1000 para o formato 1K

source: Cache Views Data
pt_br: Armazenar as Visualizações em Cache

source: Keep options when uninstall the plugin
pt_br: Manter as configurações quando excluir o plugin

source: Keep database when uninstall the plugin
pt_br: Manter o banco de dados quando remover o plugin

source: Flush cache after X hours
pt_br: Limpar o Cache a cada X horas

source: Save
pt_br: Salvar

source: Your settings were saved...
pt_br: Suas configurações foram salvas...

source: Disable views tracking for this post
pt_br: Desabilitar rastreamento de visualizações para esse post

source: Unauthorized
pt_br: Não Autorizado

source: Sorry but you can't use this resource.
pt_br: Desculpe, mas você não pode utilizar esse recurso.

source: What's new?
pt_br: O que há de novo?

source: A new feature was added! Now you can select one or more post type when getting a collection with <code>piggly_views_colletion</code>
pt_br: Um novo recurso foi adicionado! Agora você pode selecionar um ou mais tipos de publicações quando obter uma coleção utilizando <code>piggly_views_colletion</code>

source: Welcome
pt_br: Bem-vindo

source: It will store all views for a Single Post. Below you can configure it to ignore views to logged users.
pt_br: Ele armazenará todas as visualizações para uma única postagem. Abaixo, você pode configurá-lo para ignorar as visualizações de usuários conectados.

source: You can use the shortcode <code>[piggly_view]</code> to get views to the current post OR use <code>[piggly_view id="post_id"]</code> to a specific post.
pt_br: Você pode usar o shortcode <code>[piggly_view]</code> para obter visualizações para a postagem atual OU usar <code>[piggly_view id="post_id"]</code> para uma postagem específica.
